Project/Toir/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Catalogs/УпаковкиНоменклатуры/УпаковкиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостоитИзДругихУпаковок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Documents/ПоступлениеТоваровУслуг/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Приходная накладная
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриходнаяНакладная";
	КомандаПечати.Представление = НСтр("es='El ingreso de las mercancías y los servicios';ru='Поступление товаров и услуг';en='Receipt of goods and services'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;

КонецПроцедуры

// Процедура печати документа.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриходнаяНакладная") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПриходнаяНакладная",
			НСтр("es='El ingreso de las mercancías y los servicios';ru='Поступление товаров и услуг';en='Receipt of goods and services'"),
			СформироватьПечатнуюФормуПриходнойНакладной(МассивОбъектов, ОбъектыПечати),
			,
		    "Документ.ПоступлениеТоваровУслуг.ПФ_MXL_ПриходнаяНакладная");
		
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной.
//
Функция СформироватьПечатнуюФормуПриходнойНакладной(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходнаяНакладная";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПоступлениеТоваровУслуг.ПФ_MXL_ПриходнаяНакладная");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документы", МассивОбъектов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
	               |	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |	ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |	ПоступлениеТоваровУслуг.Склад КАК Склад,
	               |	ПоступлениеТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровУслугТовары.Характеристика КАК Характеристика,
	               |	ПоступлениеТоваровУслугТовары.Серия КАК Серия,
	               |	ПоступлениеТоваровУслугТовары.КоличествоУпаковок КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	               |			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения)
	               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоступлениеТоваровУслугТовары.Упаковка)
	               |	КОНЕЦ КАК ЕдИзм,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура.Артикул КАК Артикул,
	               |	ПоступлениеТоваровУслуг.Договор КАК ДоговорКонтрагента,
	               |	ПоступлениеТоваровУслугТовары.Характеристика.Наименование КАК НаименованиеХарактеристики,
	               |	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
	               |	ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеТоваровУслуг.Валюта КАК Валюта,
	               |	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	               |	ПоступлениеТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |		ПО ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслуг.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.Ссылка В(&Документы)
	               |ИТОГИ
	               |	МАКСИМУМ(Контрагент),
	               |	МАКСИМУМ(Организация),
	               |	МАКСИМУМ(Склад)
	               |ПО
	               |	Документ";
	
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		Если НЕ ЭтоПервый Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ОбластьЗаголовка = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьЗаголовка);
		
		ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Документ = ВыборкаДокумент.Документ;
		ОбластьШапки.Параметры.Склад = ВыборкаДокумент.Склад;
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		ОбластьПоставщика = Макет.ПолучитьОбласть("Поставщик");
		ОбластьПоставщика.Параметры.Контрагент = ВыборкаДокумент.Контрагент;
		ОбластьПоставщика.Параметры.ДоговорКонтрагента = ВыборкаДокумент.ДоговорКонтрагента;
		ТабличныйДокумент.Вывести(ОбластьПоставщика);
		
		ОбластьПокупателя = Макет.ПолучитьОбласть("Покупатель");
		ОбластьПокупателя.Параметры.Организация = ВыборкаДокумент.Организация;
		ТабличныйДокумент.Вывести(ОбластьПокупателя);
				
		ВыборкаТоваров = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		ИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
		ИспользоватьСерии = Константы.ИспользоватьСерииНоменклатуры.Получить();
		
		Если ИспользоватьХарактеристики И НЕ ИспользоватьСерии Тогда  
			ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицыФО");
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыФО");
			ОбластьШапка.Параметры.ЗаголовокКолонки = "Характеристика";
		ИначеЕсли ИспользоватьСерии И НЕ ИспользоватьХарактеристики Тогда
			ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицыФО");
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыФО");
			ОбластьШапка.Параметры.ЗаголовокКолонки = "Серия";
		ИначеЕсли ИспользоватьХарактеристики И ИспользоватьСерии Тогда
			ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицыФО");
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыФО");
			ОбластьШапка.Параметры.ЗаголовокКолонки = "Характеристика, серия";
		Иначе 
			ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		КонецЕсли;
		ОбластьПодвал     = Макет.ПолучитьОбласть("ПодвалТаблицы");
		ОбластьПодписи    = Макет.ПолучитьОбласть("Подписи");

		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		СчетчикПозиций = 0;
		СуммаИтого = 0;
		СуммаНДС = 0;
		Пока ВыборкаТоваров.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаТоваров);
			
			ТоварыХарактеристика = "";
			ТоварыСерия = "";
			ОбластьСтрока.Параметры.Заполнить(ВыборкаТоваров);
			Если ИспользоватьХарактеристики Тогда  
				ТоварыХарактеристика = ?(ЗначениеЗаполнено(ВыборкаТоваров.Характеристика),ВыборкаТоваров.Характеристика, 
				?(ЗначениеЗаполнено(ВыборкаТоваров.НаименованиеХарактеристики),ВыборкаТоваров.НаименованиеХарактеристики,""));
			КонецЕсли;
			Если ИспользоватьСерии Тогда
				ТоварыСерия = ?(ЗначениеЗаполнено(ВыборкаТоваров.Серия), ВыборкаТоваров.Серия, "");
			КонецЕсли;
			Если ЗначениеЗаполнено(ТоварыХарактеристика) И ЗначениеЗаполнено(ТоварыСерия) Тогда
				ОбластьСтрока.Параметры.ХарактеристикаСерия = Строка(ТоварыХарактеристика) + ", " + Строка(ТоварыСерия);
			ИначеЕсли ИспользоватьХарактеристики ИЛИ ИспользоватьСерии Тогда 
				ОбластьСтрока.Параметры.ХарактеристикаСерия = Строка(ТоварыХарактеристика) + Строка(ТоварыСерия);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			СчетчикПозиций = СчетчикПозиций + 1;
			СуммаИтого = СуммаИтого + ВыборкаТоваров.Сумма;
			СуммаНДС = СуммаНДС + ВыборкаТоваров.СуммаНДС;
			
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);		
		
		ОбластьПодписи.Параметры.Итого = СчетчикПозиций;
		Если ВыборкаДокумент.ЦенаВключаетНДС Тогда
			ОбщаяСумма = СуммаИтого;
		Иначе
			ОбщаяСумма = СуммаИтого + СуммаНДС;
		КонецЕсли;
		ОбластьПодписи.Параметры.ОбщаяСумма = ОбщаяСумма;
		ОбластьПодписи.Параметры.Валюта = ВыборкаДокумент.Валюта;		
		
		ОбластьПодписи.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОбщаяСумма, ВыборкаДокумент.Валюта);
		
		ОбластьПодписи.Параметры.СуммаИтого = СуммаИтого;
		ОбластьПодписи.Параметры.СуммаНДС = СуммаНДС;

		ТабличныйДокумент.Вывести(ОбластьПодписи);		
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти
